In [1]:
import os
os.getcwd()

'C:\\Users\\creat\\OneDrive\\Documents\\Post Bootcamp Work\\Portfolio Projects\\Retail Sales Analysis\\Notebooks'

In [2]:
import pandas as pd

In [3]:
df = pd.read_excel("../data/retail_sales_dashboard.xlsx")
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE,TotalSales,Unnamed: 26,Unnamed: 27
0,10107,60,95.70,2,2871.00,2003-02-24,Shipped,1,2,2003,...,NY,10022,USA,NaN,Yu,Kwai,Small,5742.00,NaN,NaN
1,10121,34,81.35,5,2765.90,2003-05-07,Shipped,2,5,2003,...,NaN,51100,France,EMEA,Henriot,Paul,Small,2765.90,NaN,NaN
2,10134,41,94.74,2,3884.34,2003-07-01,Shipped,3,7,2003,...,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium,3884.34,NaN,NaN
3,10145,45,83.26,6,3746.70,2003-08-25,Shipped,3,8,2003,...,CA,90003,USA,NaN,Young,Julie,Medium,3746.70,NaN,NaN
4,10159,49,100.00,14,5205.27,2003-10-10,Shipped,4,10,2003,...,CA,NaN,USA,NaN,Brown,Julie,Medium,4900.00,NaN,NaN

In [4]:
# I imported the libraries I would need in my analysis
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
os.listdir()

['.ipynb_checkpoints', 'RetailSalesAnalysis.ipynb']

In [6]:
# Completed a standard information check
df.head()
df.info()
df.isna().sum

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 28 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       2823 non-null   int64
 1   QUANTITYORDERED   2823 non-null   int64
 2   PRICEEACH         2823 non-null   float64
 3   ORDERLINENUMBER   2823 non-null   int64
 4   SALES             2823 non-null   float64
 5   ORDERDATE         2823 non-null   datetime64[ns]
 6   STATUS            2823 non-null   object
 7   QTR_ID            2823 non-null   int64
 8   MONTH_ID          2823 non-null   int64
 9   YEAR_ID           2823 non-null   int64
 10  PRODUCTLINE       2823 non-null   object
 11  MSRP              2823 non-null   int64
 12  PRODUCTCODE       2823 non-null   object
 13  CUSTOMERNAME      2823 non-null   object
 14  PHONE             2823 non-null   object
 15  ADDRESSLINE1      2823 non-null   object
 16  ADDRESSLINE2      302 non-null    object
 17  CITY              2823 non-null   object
 18  STATE             1337 non-null   object
 19  POSTALCODE        2747 non-null   object
 20  COUNTRY           2823 non-null   object
 21  TERRITORY         1749 non-null   object
 22  CONTACTLASTNAME   2823 non-null   object
 23  CONTACTFIRSTNAME  2823 non-null   object
 24  DEALSIZE          2823 non-null   object
 25  TotalSales        2823 non-null   float64
 26  Unnamed: 26       0 non-null      float64
 27  Unnamed: 27       2 non-null      float64
dtypes: datetime64[ns](1), float64(5), int64(7), object(15)
memory usage: 617.7+ KB

<bound method DataFrame.sum of       ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER  SALES  \
0           False            False      False            False  False
1           False            False      False            False  False
2           False            False      False            False  False
3           False            False      False            False  False
4           False            False      False            False  False
...           ...              ...        ...              ...    ...
2818        False            False      False            False  False
2819        False            False      False            False  False
2820        False            False      False            False  False
2821        False            False      False            False  False
2822        False            False      False            False  False

      ORDERDATE  STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  STATE  POSTALCODE  \
0         False   False   False     False    False  ...  False       False
1         False   False   False     False    False  ...   True       False
2         False   False   False     False    False  ...   True       False
3         False   False   False     False    False  ...  False       False
4         False   False   False     False    False  ...  False        True
...         ...     ...     ...       ...      ...  ...    ...         ...
2818      False   False   False     False    False  ...   True       False
2819      False   False   False     False    False  ...   True       False
2820      False   False   False     False    False  ...   True       False
2821      False   False   False     False    False  ...   True       False
2822      False   False   False     False    False  ...  False       False

      COUNTRY  TERRITORY  CONTACTLASTNAME  CONTACTFIRSTNAME  DEALSIZE  \
0       False       True            False             False     False
1       False      False            False             False     False
2       False      False            False             False     False
3       False       True            False             False     False
4       False       True            False             False     False
...       ...        ...              ...               ...       ...
2818    False      False            False             False     False
2819    False      False            False             False     False
2820    False      False            False             False     False
2821    False      False            False             False     False
2822    False       True            False             False     False

      TotalSales  Unnamed: 26  Unnamed: 27
0          False         True         True
1          False         True         True
2          False         True         True
3          False         True         True
4          False         True         True
...          ...          ...          ...
2818       False         True         True
2819       False         True         True
2820       False         True         True
2821       False         True         True
2822       False         True         True

[2823 rows x 28 columns]>

In [7]:
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE,TotalSales,Unnamed: 26,Unnamed: 27
0,10107,60,95.70,2,2871.00,2003-02-24,Shipped,1,2,2003,...,NY,10022,USA,NaN,Yu,Kwai,Small,5742.00,NaN,NaN
1,10121,34,81.35,5,2765.90,2003-05-07,Shipped,2,5,2003,...,NaN,51100,France,EMEA,Henriot,Paul,Small,2765.90,NaN,NaN
2,10134,41,94.74,2,3884.34,2003-07-01,Shipped,3,7,2003,...,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium,3884.34,NaN,NaN
3,10145,45,83.26,6,3746.70,2003-08-25,Shipped,3,8,2003,...,CA,90003,USA,NaN,Young,Julie,Medium,3746.70,NaN,NaN
4,10159,49,100.00,14,5205.27,2003-10-10,Shipped,4,10,2003,...,CA,NaN,USA,NaN,Brown,Julie,Medium,4900.00,NaN,NaN

In [8]:
df.shape

(2823, 28)

In [9]:
# Which product categories make the most money?
# How does total sales change over time?
# Which products matter most?

In [10]:
# Create a total sales column, quantity X Price = Revenue per row
df["TotalSales"]=df["QUANTITYORDERED"] * df["PRICEEACH"]

In [11]:
# I would like to look at a few things such as the order dates, quantity, prices, total sales.

df[["QUANTITYORDERED", "PRICEEACH", "TotalSales"]].head()

   QUANTITYORDERED  PRICEEACH  TotalSales
0               60      95.70     5742.00
1               34      81.35     2765.90
2               41      94.74     3884.34
3               45      83.26     3746.70
4               49     100.00     4900.00

In [12]:
# Perform an aggregation to sum all the sales for each category
sales_by_category = (
    df.groupby("PRODUCTLINE")["TotalSales"]
    .sum()
    .sort_values(ascending=False)
)

sales_by_category

PRODUCTLINE
Classic Cars        2968546.40
Vintage Cars        1644212.05
Motorcycles          973957.29
Trucks and Buses     947355.18
Planes               877942.21
Ships                677940.40
Trains               203804.26
Name: TotalSales, dtype: float64

In [13]:
# Another aggregation for the monthly sales
# Extract the month
df["YearMonth"]=df["ORDERDATE"].dt.to_period("M")

monthly_sales = df.groupby("YearMonth")["TotalSales"].sum()
monthly_sales

YearMonth
2003-01    107885.96
2003-02    122907.80
2003-03    144096.23
2003-04    169421.03
2003-05    163654.12
2003-06    139552.84
2003-07    149869.73
2003-08    166026.32
2003-09    211045.86
2003-10    466240.57
2003-11    850203.27
2003-12    210117.21
2004-01    268015.87
2004-02    258389.05
2004-03    166958.56
2004-04    172935.80
2004-05    220815.14
2004-06    245190.75
2004-07    271103.61
2004-08    386106.59
2004-09    263854.26
2004-10    452796.13
2004-11    894479.18
2004-12    313055.93
2005-01    283680.46
2005-02    289902.30
2005-03    315131.94
2005-04    217977.63
2005-05    372343.65
Freq: M, Name: TotalSales, dtype: float64

In [14]:
# Finding top products
top_products = (
    df.groupby("PRODUCTLINE")["TotalSales"]
    .sum()
    .sort_values(ascending=False)
    .head(10)
)

top_products

PRODUCTLINE
Classic Cars        2968546.40
Vintage Cars        1644212.05
Motorcycles          973957.29
Trucks and Buses     947355.18
Planes               877942.21
Ships                677940.40
Trains               203804.26
Name: TotalSales, dtype: float64

In [15]:
# From this analysis I found that the largest share of revenue comes from the Classic cars category followed by Vintage cars.
# Found a pattern of sales steadily rising in October and hitting the peak revenue in November.
# Top revenue is concentrated in the cars category.

In [16]:
sales_by_category.to_csv("../outputs/sales_by_category.csv")
monthly_sales.to_csv("../outputs/monthly_sales.csv")
top_products.to_csv("../outputs/top_products.csv")

In [17]:
import os
os.listdir("../outputs")

['monthly_sales.csv', 'sales_by_category.csv', 'top_products.csv']